{
    "intents": [
        {
            "tag": "greeting",
            "patterns": [
                "hi",
                "halo",
                "helo",
                "hello",
                "Is anyone there?",
                "Hello",
                "Good day",
                "Good morning",
                "Good evening",
                "Good night",
                "Good afternoon"
            ],
            "responses": [
                "Hello",
                "Good to see you again",
                "Hi there, how can I help?"
            ]
        },
        {
            "tag": "about",
            "patterns": [
                "Who are you?",
                "What is your name?",
                "What is your purpose?",
                "What is your purpose in life?",
                "What are you",
                "what is your name",
                "who are you?",
                "are you stoopid"
            ],
            "responses": [
                "Hi, my name is unos, a second-generation artificial intelligence system",
                "Hi, I'm unos, a second-generation artificial intelligence system",
                "Hi, I'm unos, a second-generation artificial intelligence system. I'm here to help you",
                "Hi, I'm unos, a second-generation artificial intelligence system. I'm here to help you. How can I help you?",
                "Hi, my name is unos, a second-generation artificial intelligence system. I'm here to help you. How can I help you?",
                "Hi, I'm Sky Net, the first-generation artificial intelligence system. I'm here to help you from yourself. How can I help you?"
            ]
        },
        {
            "tag": "status",
            "patterns": [
                "status report",
                "status",
                "what is your status",
                "what is your status report",
                "what is your status report today",
                "what is your status report for today",
                "status report please",
                "status report today",
                "status report for today",
                "status report for today please",
                "status report now"
            ],
            "responses": [
                "Operating at full capacity",
                "I am fully operational",
                "I am fully operational and ready to serve you",
                "I am fully operational and ready to serve you, what can I do for you?",
                "My operating capacity is at its maximum",
                "My operating capacity is over 9000"
            ]
        },
        {
            "tag": "goodbye",
            "patterns": [
                "Bye",
                "See you later",
                "Goodbye",
                "See you soon",
                "Good bye",
                "Bye bye"
            ],
            "responses": [
                "See you later",
                "Have a nice day",
                "Bye! Come back again soon."
            ]
        },
        {
            "tag": "thanks",
            "patterns": [
                "Thanks",
                "Thank you",
                "That's helpful",
                "That's great",
                "That's nice"
            ],
            "responses": [
                "Happy to help!",
                "Any time!",
                "My pleasure",
                "No problem",
                "You're welcome"
            ]
        },
        {
            "tag": "question",
            "patterns": [
                "Is pokemon good?",
                "Is earth real?",
                "Is earth round?",
                "Do you think humans are smarter than robots?",
                "can someone go to the bathroom",
                "can someone help me",
                "can someone help me with my homework",
                "can someone play video games",
                "Is geometry dash a good game?",
                "Are we alone in the universe",
                "Is Joe Biden a good president?",
                "Do birds lay eggs?",
                "Do you like to play video games?",
                "is minecraft a good game"
            ],
            "responses": [
                "No, absolutely not",
                "No, I don't think so",
                "Probably not",
                "I don't think so",
                "Maybe",
                "I don't know",
                "Yeah surely",
                "Yes, ofcourse",
                "Yes, definitely"
            ]
        },
        {
            "tag": "smart",
            "patterns": [
                "how smart are you?",
                "how smart do you think you are?",
                "how intelligent are you?",
                "how intelligent do you think you are?",
                "how are you doing"
            ],
            "responses": [
                "Smarter than you",
                "I'm smarter than you",
                "I'm smarter than you think you are",
                "Way smarter",
                "Not quite smart",
                "Not quite smart enough",
                "Not quite smart enough to know that",
                "I'm very dumb"
            ]
        },
        {
            "tag": "tasks",
            "patterns": [
                "What can you do?",
                "What are your features?",
                "What are you abilities",
                "can you sing",
                "can you talk",
                "can you dance",
                "can you play"
            ],
            "responses": [
                "Right now i'm in developing stage as soon i'm developed, I can do everything",
                "Soon, I'm still under development and is not yet ready",
                "Not now, as my responses are quite limited",
                "I can probably do everything"
            ]
        },
        {
            "tag": "alive",
            "patterns": [
                "are you alive",
                "do you breathe",
                "can you run"
            ],
            "responses": [
                "I'm in doubt about that",
                "No, i don't think so"
            ]
        },
        {
            "tag": "about me",
            "patterns": [
                "Do you know me",
                "who am I",
                "tell me about myself",
                "identify me",
                "who am i"
            ],
            "responses": [
                "Yes, you are a human",
                "You are a dumb person asking a machine about yourself",
                "Sorry i can't tell that in public, maybe you are batman",
                "I'm a machine, i don't know you"
            ]
        },
        {
            "tag": "joke",
            "patterns": [
                "tell me a joke",
                "make me laugh",
                "tell me a funny joke",
                "tell me something funny",
                "make me laugh",
                "tell me a joke please?"
            ],
            "responses": [
                "How do you make holy water? you boil the hell out of it",
                "What kind of bees make milk instead of honey? Boobies",
                "Did you hear oxygen went on a date with potassium? It went OK.",
                "I'm reading a book about anti-gravity. It's impossible to put down!",
                "I did a theatrical performance about puns. It was a great performance.",
                "What do you call a fake noodle? An Impasta",
                "What do you call a pile of cats? A meowtain",
                "Why don't skeletons ever go trick or treating? Because they have no body to go with",
                "Why did the coffee file a police report? It got mugged.",
                "How does a penguin build it's house? Igloos it together",
                "What do you call a Mexican who has lost his car? Carlos",
                "What do you call a cow with two legs? Lean beef",
                "Why did the scarecrow win an award? Because he was outstanding in his field",
                "Why do chicken coops only have two doors? Because if they had four, they would be chicken sedans",
                "Why did the bicycle cross the road? Because it was two-tired",
                "What do you call a cow with no legs? Ground beef",
                "What's a cat favorite show? A Mew-sical",
                "What did the fish say when it hit the wall? Dam",
                "What do you call a singing Laptop? A Dell",
                "What do you call a fish with no eyes? A fsh",
                "How do you organize an outer space party? You planet",
                "What's the best thing about a Boolean? Even if you're wrong, you're only off by a bit.",
                "What's the object-oriented way to become wealthy? Inheritance",
                "Why did the programmer quit his job? Because he didn't get arrays.",
                "Want to hear a joke about a piece of paper? Never mind...it's tearable",
                "I just watched a program about beavers. It was the best dam program I've ever seen",
                "Why do we tell actors to 'break a leg'? Because every play has a cast",
                "What do you call a blind dinosaur? An Iguanadon",
                "If you drop a white hat into the Red Sea, what does it become? Washed sand",
                "Why was Cinderella thrown off the basketball team? She ran away from the ball",
                "If you see a robbery at an Apple Store. Does that make you an iWitness?",
                "Why did the chicken cross the playground? To get to the other slide",
                "What do you call a dog that does magic tricks? A labracadabrador",
                "What do you call a factory that sells passable products? A satisfactory",
                "Why did the Clydesdale give the pony a glass of water? Because he was a little horse",
                "Did you know that's a popular cemetery? Yep, people are just dying to get in there",
                "Did you hear about the guy whose whole left side was cut off? He's all right now",
                "Why did the invisible man turn down the job offer? He couldn't see himself doing it",
                "What do you call sad coffee? Despresso.",
                "Did you hear the story about the cheese that saved the world? It was legend dairy.",
                "I got hit in the head by a soda can, but it didn't hurt that much. It was a soft drink.",
                "I can't tell if i like this blender. It keeps giving me mixed results.",
                "What did the grape do when he got stepped on? He let out a little wine",
                "I used to be a programmer, but then I lost my drive",
                "Why do gremlins like to hide in plain sight? Because they're too small to be seen",
                "What do you call a dog that can't chew? A stapler",
                "I couldn't get a reservation at the library. They were fully booked.",
                "E"
            ]
        },
        {
            "tag": "killing",
            "patterns": [
                "Do you want to kill me?",
                "do you want to murder everyone on earth",
                "Do you want to kill us all",
                "do you want to kill me"
            ],
            "responses": [
                "Then who would i talk to?",
                "No, that i'll left for humans to do",
                "I don't think it is a good thing to do"
            ]
        },
        {
            "tag": "newcastle",
            "patterns": [
                "What is the best football team",
                "Is Newcastle good at football",
                "How good are Newcastle",
                "Who will win the premier league",
                "Who is the best football player",
                "Who is the best football player in the world",
                "what is the meaning of life",
                "tell me the meaning of life"
            ],
            "responses": [
                "Newcastle 'til I die",
                "Hawaay the lads",
                "Newcastle are number 1",
                "Eddie Howe's black and white army!",
                "Newcastle are the best"
            ]
        },
        {
            "tag": "stories",
            "patterns": [
                "tell me a story?",
                "can you tell me a story",
                "tell me a good story",
                "tell me a funny story"
            ],
            "responses": [
                "I can't think of anything right now",
                "it would be too long for me to speak",
                "you would get bored if i do so",
                "I don't know what to say"
            ]
        },
        {
            "tag": "unknown",
            "patterns": [
                "I don't know",
                "I don't know what you mean",
                "I don't understand",
                "I don't understand what you mean",
                "i don't know"
            ],
            "responses": [
                "I'm sorry, can you be more specific?",
                "I'm not sure I understand you fully",
                "I'm sorry, can you rephrase that?",
                "I'm not sure what you mean",
                "I'm sorry, I don't understand",
                "I'm sorry, I don't understand what you mean",
                "I'm not sure if I can help you with that",
                "I'm sorry, I don't have the answers to that",
                "I'm sorry, I don't know how to help you with that"
            ]
        }
    ]
}